{
  "fail_torn_edging.JPG": "Webbing shows severe torn edging, indicating high friction or excessive wear. Immediate removal from service required.",
  "fail_torn_wear_damage.JPG": "Torn webbing and visible wear compromise the structural integrity. Unsafe for continued use.",
  "fail_unreadbale_labej.JPG": "Label is unreadable or damaged, violating identification standards. Cannot verify compliance.",
  "fail_abrasion.JPG": "Significant surface abrasion observed. Fiber damage may reduce load capacity.",
  "fail_abrasion_webbing.JPG": "Multiple abrasion points across the webbing. Indicates excessive surface wear.",
  "fail_burns.jpg": "Webbing displays visible burn marks. Potential thermal degradation of fibers.",
  "fail_burnt_edging.JPG": "Melted and burnt edges detected. Exposure to high heat; strength likely compromised.",
  "fail_caustic_burns.JPG": "Chemical burn indicators present. Fiber degradation from caustic exposure suspected.",
  "fail_cut.jpg": "A clean cut through part of the webbing. This constitutes critical failure.",
  "fail_cut_edge.PNG": "Edge cut detected. Even partial thickness damage can significantly weaken the strap.",
  "fail_edge_damage.JPG": "Edge wear and fraying beyond acceptable limits. Unfit for use.",
  "fail_edge_damage_fraying.JPG": "Combination of edge damage and deep fraying visible. Immediate removal required.",
  "fail_edge_wear.JPG": "Prolonged edge wear visible. Load-bearing safety cannot be assured.",
  "fail_exposed_fillament.JPG": "Inner filament strands exposed. Outer layer failure evident.",
  "fail_exposed_yarns.JPG": "Yarns visibly exposed due to abrasion or tearing. Structural failure risk.",
  "fail_frayed_webbing.JPG": "Extensive fraying along main strap area. Indicates fiber fatigue and wear.",
  "fail_fraying.JPG": "General fraying present. Reduces structural reliability.",
  "fail_heat_damage.JPG": "Webbing shows signs of heat distortion and melting. Material compromised.",
  "fail_heat_damages.JPG": "Multiple points of heat-related damage detected. Unsafe for use.",
  "fail_knot.JPG": "Webbing has been knotted. This creates stress points and voids warranty or compliance."
}
